In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('student.csv')

In [3]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [4]:
# mean
df.mean()

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [5]:
# median
df.median()

roll      5.50
marks    64.31
age      20.00
dtype: float64

In [6]:
df.std()

roll     3.027650
marks    9.207179
age      1.269296
dtype: float64

In [7]:
# min
df.min()

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [8]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [9]:
import numpy as np
np.std(df['marks'])

8.734696846485285

In [10]:
gr1 = df.groupby('class')

In [11]:
te = gr1.get_group('TE')

In [12]:
te.min()

roll           1
name     ajinkya
class         TE
marks      56.75
age           20
dtype: object

In [13]:
te.max()

roll         9
name      asha
class       TE
marks    69.66
age         22
dtype: object

In [14]:
gr2 = df.groupby('age')

In [15]:
gr2.groups

{19: Int64Index([2, 6], dtype='int64'),
 20: Int64Index([3, 4, 5, 8], dtype='int64'),
 21: Int64Index([1, 9], dtype='int64'),
 22: Int64Index([0], dtype='int64'),
 23: Int64Index([7], dtype='int64')}

In [16]:
tw = gr2.get_group(20)

In [17]:
tw

   roll     name class  marks  age
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
8     9     amol    TE  56.75   20

In [18]:
import seaborn as sns

In [19]:
df = sns.load_dataset('iris')

In [20]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [21]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [22]:
gr = df.groupby('species')

In [23]:
se = gr.get_group('setosa')
ve = gr.get_group('versicolor')
vi = gr.get_group('virginica')

In [24]:
se.shape

(50, 5)

In [25]:
ve.shape

(50, 5)

In [26]:
vi.shape

(50, 5)

In [27]:
se.describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000    50.000000
mean        5.00600     3.428000      1.462000     0.246000
std         0.35249     0.379064      0.173664     0.105386
min         4.30000     2.300000      1.000000     0.100000
25%         4.80000     3.200000      1.400000     0.200000
50%         5.00000     3.400000      1.500000     0.200000
75%         5.20000     3.675000      1.575000     0.300000
max         5.80000     4.400000      1.900000     0.600000

In [28]:
vi.describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        6.58800     2.974000      5.552000      2.02600
std         0.63588     0.322497      0.551895      0.27465
min         4.90000     2.200000      4.500000      1.40000
25%         6.22500     2.800000      5.100000      1.80000
50%         6.50000     3.000000      5.550000      2.00000
75%         6.90000     3.175000      5.875000      2.30000
max         7.90000     3.800000      6.900000      2.50000

In [29]:
ve.describe()

       sepal_length  sepal_width  petal_length  petal_width
count     50.000000    50.000000     50.000000    50.000000
mean       5.936000     2.770000      4.260000     1.326000
std        0.516171     0.313798      0.469911     0.197753
min        4.900000     2.000000      3.000000     1.000000
25%        5.600000     2.525000      4.000000     1.200000
50%        5.900000     2.800000      4.350000     1.300000
75%        6.300000     3.000000      4.600000     1.500000
max        7.000000     3.400000      5.100000     1.800000